# FamilyMembersReferToOutsideFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyMembersReferToOutsideFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Memebrs of Family '[Name]' or a nested family thereof illegally refer to Elements outside the family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyMembersReferToOutsideFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyMembersReferToOutsideFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyMembersReferToOutsideFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace